#+TITLE: Ocaml Modules In Rust
#+LAYOUT: post
#+CATEGORIES: Rust Ocaml

* Modules in rust
#+begin_src rust :tangle modules.crs
#!/usr/bin/env run-cargo-script
#+end_src

Note that a trait with associated type is pretty close to a module signature in the ocaml meaning:
#+begin_src rust :tangle modules.crs
pub trait MyModuleSig {
    type T;
    type B;

    const T_INIT: Self::T;
    const B_INIT: Self::B;

    fn some_func(t: Self::T, b: Self::B) -> i32;
}
#+end_src

#+RESULTS:

#+begin_src rust :tangle modules.crs
mod my_module{
    pub struct T(i32);
    pub struct B(i32);

    pub const T_INIT: T = T(0);
    pub const B_INIT: B = B(0);

    pub fn some_func(t: T, b: B) -> i32 {
        t.0 + b.0
    }
}
#+end_src

#+begin_src rust :tangle modules.crs
// This is close to a value module
struct MyModuleAsSigObject;
impl MyModuleSig for MyModuleAsSigObject{
    type T = my_module::T;
    type B = my_module::B;

    const T_INIT: Self::T = my_module::T_INIT;
    const B_INIT: Self::B = my_module::B_INIT;

    fn some_func(t: my_module::T, b: my_module::B) -> i32{
        my_module::some_func(t, b)
    }
}

// Now, we re-export the module as implementor of the signature
mod my_module_as_sig{
    use super::{MyModuleAsSigObject, MyModuleSig};

    pub type T = <MyModuleAsSigObject as MyModuleSig>::T;
    pub type B = <MyModuleAsSigObject as MyModuleSig>::B;

    pub const T_INIT: T = <MyModuleAsSigObject as MyModuleSig>::T_INIT;
    pub const B_INIT: B = <MyModuleAsSigObject as MyModuleSig>::B_INIT;

    pub fn some_func(t: T, b: B) -> i32{
        <MyModuleAsSigObject as MyModuleSig>::some_func(t, b)
    }
}
#+end_src

#+RESULTS:
: error: Could not compile `cargoun0IB1`.

#+BEGIN_SRC rust :tangle module.crs
// The signature of the input module
pub trait InputSig{
    type T;
    const T_INIT;
    fn some_func(t1: T, t2: T) -> i32;
}


mod input_mod{
    pub struct T(i32);
    pub const T_INIT: T = T(0);
    pub fn some_func(t1: T, t2: T) -> i32 {
        t1.0 + t2.0
    }
}

struct InputModObject;
impl InputSig for InputModObject{
    type T = input_mod::T;
    const T_INIT: Self::T = input_mod::T_INIT;
    fn some_func(t1: input_mod::T, t2: input_mod::T) -> i32{
        input_mod::some_func(t, b)
    }
}

mod input_mod_as_sig{
    use super::{InputSig, InputModObject};
    pub type T = <InputModObject as InputSig>::T;
    pub const T_INIT: T = <InputModObject as InputSig>::T_INIT;
    pub fn some_func(t1: T, t2: T) -> i32{
        <InputModObject as InputSig>::some_func(t1, t2)
    }
}
#+END_SRC

#+begin_src rust :tangle module.crs
// We declare the output signature
pub trait OutputSig {
    type T;
    type B;

    const T_INIT: Self::T;
    const B_INIT: Self::B;

    fn some_func(t: Self::T, b: Self::B) -> i32;
}

// We declare the functor
struct FunctorObject<M: InputSig>(M);
impl<M> OutputSig for FunctorObject(M) where M: InputSig{
    type T = <M as InputSig>::T;
    type B = <M as InputSig>::T;
    const T_INIT = <M as InputSig>::T_INIT;
    const B_INIT = <M as InputSig>::T_INIT;
    fn some_func(t: Self::T, b: Self::B) -> i32{
        <M as InputSig>::some_func(t, b)
    }
}

// We apply the functor
type OutputModObject = FunctorObject(InputModObject);

mod output_mod_as_sig{
    use super::{OutputSig, OutputModObject};

    pub type T = <OutputModObject as OutputSig>::T;
    pub type B = <OutputModObject as OutputSig>::B;

    pub const T_INIT: T = <OutputModObject as OutputSig>::T_INIT;
    pub const B_INIT: B = <OutputModObject as OutputSig>::B_INIT;

    pub fn some_func(t: T, b: B) -> i32{
        <OutputModObject as OutputSig>::some_func(t, b)
    }
}
#+end_src

#+begin_src rust :tangle modules.crs
fn main() {
    println!("That's all functors!");
}
#+end_src
